from jinja2 import Template
from markupsafe import escape
# import re

# data = """65	101	0x41	01000001	A	&#65;	
# 66	102	0x42	01000010	B	&#66;	
# 67	103	0x43	01000011	C	&#67;	
# 68	104	0x44	01000100	D	&#68;	
# 69	105	0x45	01000101	E	&#69;	
# 70	106	0x46	01000110	F	&#70;	
# 71	107	0x47	01000111	G	&#71;	
# 72	110	0x48	01001000	H	&#72;	
# 73	111	0x49	01001001	I	&#73;	
# 74	112	0x4A	01001010	J	&#74;	
# 75	113	0x4B	01001011	K	&#75;	
# 76	114	0x4C	01001100	L	&#76;	
# 77	115	0x4D	01001101	M	&#77;	
# 78	116	0x4E	01001110	N	&#78;	
# 79	117	0x4F	01001111	O	&#79;	
# 80	120	0x50	01010000	P	&#80;	
# 81	121	0x51	01010001	Q	&#81;	
# 82	122	0x52	01010010	R	&#82;	
# 83	123	0x53	01010011	S	&#83;	
# 84	124	0x54	01010100	T	&#84;	
# 85	125	0x55	01010101	U	&#85;	
# 86	126	0x56	01010110	V	&#86;	
# 87	127	0x57	01010111	W	&#87;	
# 88	130	0x58	01011000	X	&#88;	
# 89	131	0x59	01011001	Y	&#89;	
# 90	132	0x5A	01011010	Z   &#90;"""

# regex = r"(\d+)\s+\d+\s+\w+\s+(\d+)\s+(\w)"
# mathcs = []
# for line in data.split('\n'):
#     mathcs.append((re.search(regex, line).groups()))

# link = """{% for elem in data -%}
# {% if elem[2]== 'Z' -%}
# Буква ZZZZZZZZZZ -> {{elem[2]}} номер -> {{elem[0], elem[1]}}
# {% else -%}
# Буква -> {{elem[2]}} номер -> {{elem[0], elem[1]}}
# {% endif -%}
# {% endfor -%}"""

# tm = Template(link)
# msg = tm.render(data = mathcs)
# print(msg)


data = {
    
}
text = """
"""